[
    {
        "name": "Horseshoe",
        "description": "The U-shaped formation of the original campus has seen more than two centuries of history unfold, earning a position on the National Register of Historic Places. For decades (and even centuries), the buildings have stood resolutely, bearing witness to the atrocities of war, fire and riots. They've also been proud hosts, welcoming esteemed guests such as President William Howard Taft and Pope John Paul II. Painstakingly preserved, the structures on the Horseshoe tell a colorful tale, not only of the university's history, but of events that shaped South Carolina as a whole.",
        "year": "1801",
        "buildingID": "Horseshoe",
        "location": "The Horseshoe Columbia, SC 29208",
        "closestPOI": "n/a",
        "photos": [
            "Horseshoe1",
            "Horseshoe2",
            "Horseshoe3"
        ]
    },
    {
        "name": "Rutledge College",
        "description": "The very first building constructed for South Carolina College, originally known as South Building, opened its doors in 1805. It contained a dormitory, lecture hall, chapel and library. In 1855, a fire severly destroyed the original elements of the chapel and the west wing of the building and was subsequently rebuilt. When the university was desegregated between 1873 and 1877, this building housed the State Normal School for Teachers, a program that trained African Americans to become teachers. The building is currently used for student dormitories, and the renovated chapel is available for rentals.",
        "year": "1805",
        "buildingID": "rutledgeCollege",
        "location": "Rutledge College, Columbia, SC 29208",
        "closestPOI": "n/a",
        "photos": [
            "Rutledge1",
            "Rutledge2",
            "Rutledge3"
        ]
    },
    {
        "name": "McKissick Museum",
        "description": "The structure that currently houses McKissick Museum is the only twentieth-century building standing on the Horseshoe. It functioned as McKissick Library, the university's main library until the construction of Thomas Cooper Library in 1959. In 1984, the Roosevelt-era facility was rededicated as McKissick Museum, which today houses a nationally recognized southern folk life collection.",
        "year": "1940",
        "buildingID": "mckissickMuseum",
        "location": "1501 Pendleton St, Columbia, SC 29208",
        "closestPOI": "n/a",
        "photos": [
            "McKissick1",
            "McKissick2",
            "McKissick3"
        ]
    },
    {
        "name": "DeSaussure College",
        "description": "DeSaussure College was named for Henry William DeSaussure (1763-1839), who served in the Revolutionary War and later as a politician in both chambers of the South Carolina legislature. The structure, constructed as a twin of Rutledge College, served as a hospital during the Civil War, and was the site of the first medical school at Carolina from 1866-1873. During Reconstruction, one wing served as a federal military prison while the university and the city were occupied. During World War I, one wing served as the first women’s dormitory. During the 1970s Horseshoe Restoration Project, archaeologists discovered DeSaussure’s original foundation had been 100 feet closer to Rutledge.",
        "year": "1809",
        "buildingID": "desaussureCollege",
        "location": "DeSaussure CollegeColumbia, SC 29208",
        "closestPOI": "n/a",
        "photos": [
            "DeSaussure1",
            "DeSaussure2",
            "DeSaussure3"
        ]
    },
    {
        "name": "President's House",
        "description": "The Original President's House was occupied by every president from 1807-1922. After 1922, its condition was determined to be too poor to continue to serve as the president’s residence and it was converted to offices. It was demolished in 1940 — the only major Horseshoe building demolished in the 20th century. The original structure was demolished and rebuilt in 1855, and it remained as a faculty residence until the university ceased providing faculty housing. President Donald S. Russell renovated the building, converting it into the President's House. A centerpiece of the campus, it has hosted numerous visiting dignitaries, including Pope John Paul II in 1987.",
        "year": "1810; 1854",
        "buildingID": "President",
        "location": "President's HouseColumbia, SC 29208",
        "closestPOI": "n/a",
        "photos": [
            "President1",
            "President2",
            "President3"
        ]
    },
    {
        "name": "McCutchen House",
        "description": "McCutchen House was the second faculty double residence constructed at South Carolina College, likely designed after the Blacklock House in Charleston, S.C. The house hosted two of the longest-serving faculty members in school history — Maximilian LaBorde (1804-1873) and George McCutchen (1876-1951). The building is named for George McCutchen, who taught economics from 1900 to 1948. McCutchen lived in the house from 1915 until the university stopped providing faculty housing in 1945.",
        "year": "1813",
        "buildingID": "mccutchenHouse",
        "location": "The Horseshoe Columbia, SC 29208",
        "closestPOI": "n/a",
        "photos": [
            "McCutchen1",
            "McCutchen2",
            "McCutchen3"
        ]
    },
    {
        "name": "Pinckney Legare College",
        "description": "Pinckney College was designed solely as student housing and lacks the central academic portions of other Horseshoe buildings. Pinckney is named for Charles Cotesworth Pinckney (1746-1825) and his cousin, Charles Pinckney (1757-1824). Charles C. Pinckney was a Revolutionary War general, legislator, diplomat and one of the first members of the college’s board of trustees. Legare's design included a meeting hall on the third floor for the Clariosophic Literary Society, one of the first two student organizations in Carolina history. Legare was used as a Confederate hospital during the Civil War and, when the university was desegregated from 1873-1877 during Reconstruction, it became the primary residence hall for the predominantly African American student body. Among its residents was T. McCants Stewart, the first African American graduate of Carolina.",
        "year": "1837; 1848",
        "buildingID": "pickneyLegare",
        "location": "The Horseshoe Columbia, SC 29208",
        "closestPOI": "n/a",
        "photos": [
            "Pinckney1",
            "Pinckney2",
            "Pinckney3"
        ]
    },
    {
        "name": "Harper Elliott College",
        "description": "Elliott College was designed solely as student housing and lacks central academic space. The building was named for Stephen Elliott (1771-1830), a botanist, educator, state legislator and one of the founders of the State Bank of South Carolina in 1812. Harper College was constructed at the same time and follow the pattern established by Rutledge College of a central academic section flanked by wings of student housing. Its third floor meeting hall was used by the Euphradian Literary Society, one of the first two student organizations at South Carolina College. The building was named for William Harper (1790-1847), an early graduate of South Carolina College (1808) who served as a state legislator, United States Senator, judge, state chancellor and member of the board of trustees.",
        "year": "1837; 1848",
        "buildingID": "harperElliott",
        "location": "The Horseshoe Columbia, SC 29208",
        "closestPOI": "n/a",
        "photos": [
            "Harper1",
            "Harper2",
            "Harper3"
        ]
    },
    {
        "name": "Leiber College",
        "description": "The third faculty double residence constructed, Lieber College was used as a faculty residence until the 1940s, when the university ceased providing faculty housing. The building is named for Francis Lieber (1800-1872), who lived in the house until 1855. Lieber was an internationally known professor of history and political economy, founder of the Encyclopedia Americana and one of the college’s most illustrious scholars. During the four years in the 1870's that the university was desegregated, Lieber College was the home of Carolina’s first African American faculty member, Richard T. Greener (1844-1922)",
        "year": "1837",
        "buildingID": "Leiber",
        "location": "899-849 Sumter St, Columbia, SC 29201",
        "closestPOI": "n/a",
        "photos": [
            "Leiber1",
            "Leiber2",
            "Leiber3"
        ]
    },
    {
        "name": "South Caroliniana Library",
        "description": "The South Caroliniana Library is the oldest freestanding academic library in the United States. The structure is based on plans submitted by Robert Mills, a South Carolinian, the nation’s first federal architect and the designer of the Washington Monument. The second floor reading room is a replica of the original reading room of the Library of Congress. Wings designed by J. Carroll Johnson were added in 1927 to provide more storage and work space. It served as the main college library for 100 years. The historic building became the South Caroliniana Library, a repository for published and unpublished materials relating to the history, literature and culture of South Carolina, and one of the nation’s top repositories of Southern manuscripts. The term 'Caroliniana' means 'things pertaining to Carolina.'",
        "year": "1840, 1927",
        "buildingID": "southCaroliniana",
        "location": "910 Sumter St, Columbia, SC 29208",
        "closestPOI": "n/a",
        "photos": [
            "Library1",
            "Library2",
            "Library3"
        ]
    },
    {
        "name": "Edward Storey Innovation Center",
        "description": "The Storey Engineering and Innovation Center is housed in the first two floors of five for Applied Innovation building at Blossom and Assembly streets. The 44,000-square-feet of space will house research and teaching activity related to cyber security, robotics, computer information systems and integrated information technology. The goal is to create a space where students and researchers from different disciplines can interact and collaborate on projects.",
        "year": "",
        "buildingID": "innovCenter",
        "location": "550 Assembly St, Columbia, SC 29201",
        "closestPOI": "n/a",
        "photos": [
            "Storey1",
            "Storey2",
            "Storey3"
        ]
    },
    {
        "name": "Swearingen Engineering Center",
        "description": "Turn the technical into the functional. Logic into language. And, with a bit of creativity, the complex into the captivating. No matter your path, you’ll be challenged to turn real-life problems into savvy industry solutions in the College of Engineering and Computing at the University of South Carolina.",
        "year": "1987",
        "buildingID": "swearingen",
        "location": "301 Main St, Columbia, SC 29208",
        "closestPOI": "n/a",
        "photos": [
            "Swearingen1",
            "Swearingen2",
            "Swearingen3"
        ]
    },
    {
        "name": "Thomas Cooper Library",
        "description": "Thomas Cooper Library, constructed in 1976, is the home of the University Libraries. Here, students can rent books, reserve study space, and browse special collections of maps, art, music, manuscripts and more.",
        "year": "",
        "buildingID": "thomasCooper",
        "location": "1322 Greene St, Columbia, SC 29208",
        "closestPOI": "n/a",
        "photos": [
            "Tcoop1",
            "Tcoop2",
            "Tcoop3"
        ]
    },
    {
        "name": "Russell House University Union",
        "description": "The Russell House is the home of the majority of our dining locations on campus. You can also find the leadership and service center here, the home of Student Government and over 500 on campus student organizations. Gamecock Entertainment hosts free movie showings every weekend in the Russell House theater located on the second floor.",
        "year": "",
        "buildingID": "russellHouse",
        "location": "",
        "closestPOI": "n/a",
        "photos": [
            "RH1",
            "RH2",
            "RH3"
        ]
    },
    {
        "name": "williams-Brice Stadium",
        "description": "Williams-Brice Stadium is the home of the South Carolina Gamecocks football team. Built in 1934, the stadium has been renovated 4 times since then, and currently has a capacity of over 80,000.",
        "year": "",
        "buildingID": "williamsBrice",
        "location": "1174 George Rogers Boulevard",
        "closestPOI": "n/a",
        "photos": [
            "WB1",
            "WB2",
            "WB3"
        ]
    },
    {
        "name": "Stone Stadium",
        "description": "Stone Stadium hosts the Gamecock mens and womens soccer teams. The stadium can seat 5000 fans and was built in 1981. It is named after Eugene E. Stone, the donor who made the construction of the current grandstand possible.",
        "year": "",
        "buildingID": "stoneStadium",
        "location": "1313 Heyward Street",
        "closestPOI": "n/a",
        "photos": [
            "Stone1",
            "Stone2",
            "Stone3"
        ]
    },
    {
        "name": "Founders Park",
        "description": "The Founders Park baseball stadium opened in 2009 under its original name, Carolina Stadium. With a capacity of 8,242, it is home to the South Carolina Gamecocks baseball team.",
        "year": "",
        "buildingID": "foundersPark",
        "location": "1313 Heyward Street",
        "closestPOI": "n/a",
        "photos": [
            "FP1",
            "FP2",
            "FP3"
        ]
    },
    {
        "name": "Colonial Life Arena",
        "description": "Colonial Life Arena is a multi purpose facility in Columbia, hosting concerts, rallies, competitions, and sports game. Its primary purpose is as the home of the South Carolina mens and womens basketball teams.",
        "year": "",
        "buildingID": "colonialLife",
        "location": "801 Lincoln St",
        "closestPOI": "n/a",
        "photos": [
            "CLA1",
            "CLA2",
            "CLA3"
        ]
    },
    {
        "name": "Wade's House",
        "description": "This is a test POI, located in Maryland.",
        "year": "",
        "buildingID": "wadesHouse",
        "location": "Somewhere north of SC",
        "closestPOI": "n/a",
        "photos": [
            "CLA1",
            "CLA2",
            "CLA3"
        ]
    }
    
]
